In [67]:
import pandas as pd
import numpy as np


data = pd.read_table('input.txt',sep='\s+', engine='python')
data.head()

   ID    animal  gender nickname dateofbirth dateofarive
0  42       cat    male   Pushok  13.09.2015  31.12.2016
1  43       dog  female     Dora  29.01.2015  31.12.2016
2   3  elephant    male    Archi  03.03.2011  31.12.2016
3  45       cat  female  Pushoka  13.09.2005  31.12.2016
4  33       dog    male     Doga  10.01.2015  31.12.2018

In [98]:
s = data['animal'].value_counts()
data = data.sort_values(by=['animal'])
data.head()
n = 0
notPrint = True
for i in range (0, len(s)):
    male = False
    female = False
    for j in range (0, s[i]):
        if(data.iloc[n]['gender'] == "male"):
            male = True
        if(data.iloc[n]['gender'] == "female"):
            female = True
        n += 1
    if(male and female):
        print(data.iloc[n-1]['animal'])
        notPrint = False
    
if(notPrint):
    print(0)

cat
dog

In [78]:
n = 0
for i in range (0,len(s)):
    print(data.iloc[n]['animal'] , " - ", s[i])
    n += s[i]

cat  -  2
dog  -  2
elephant  -  1

In [82]:
calls = pd.read_table('the_calls.txt',sep='\s+', engine='python')

calls.head()

         date  sec person    telephone
0  2021.12.12    3      B  79090329400
1  2019.10.03   18      A  79999995454
2  2020.05.04   13      B  72352452532
3  2020.05.04    4      A  79023987567

In [89]:
calls = calls.sort_values(by=['person', 'sec'], ascending = [True, False] )
calls.head()

         date  sec person    telephone
1  2019.10.03   18      A  79999995454
3  2020.05.04    4      A  79023987567
2  2020.05.04   13      B  72352452532
0  2021.12.12    3      B  79090329400

In [97]:
np.savetxt(r'calls.txt', calls.values, fmt='%s')